app/controllers/gets_controller.rb

SELECT "gets".* FROM "gets"
---
  def index
    if params[:project].nil?
      @gets = Get.all

INSERT INTO "gets" ("created_at", "project", "result", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-03-10 14:14:03.962872"], ["project", "1"], ["result", "test1"], ["title", "test1"], ["updated_at", "2015-03-10 14:14:03.962872"], ["url", "test1"]]
---
    else
# 如果commit不带参数，则转到创建成功页面或提示失败
      respond_to do |format|
        if @get.save

UPDATE "gets" SET "result" = $1, "title" = $2, "updated_at" = $3, "url" = $4 WHERE "gets"."id" = 4  [["result", "啊1"], ["title", "啊啊啊1"], ["updated_at", "2015-03-11 10:19:29.051861"], ["url", "啊1"]]
---
  def update
    if params[:commit] == "getData_ajax" || params[:commit] == "获取数据"

      @get_url = params[:get][:url]
      @get_url = "http://#{params[:get][:url]}" unless params[:get][:url].include? "http"

      respond_to do |format|
# ajax异步调用
          format.js {}
      end
    else
      respond_to do |format|
# 如果用例更新成功后，先删除cucumber旧的测试用例，再添加更新后的测试用例到cucumber文件中
        if @get.update(get_params)

DELETE FROM "gets" WHERE "gets"."id" = $1  [["id", 12]]
---
  def destroy
    @get.destroy

SELECT  "gets".* FROM "gets"  WHERE "gets"."id" = $1 LIMIT 1  [["id", 17]]
---
    def set_get
      @get = Get.find(params[:id])