app/controllers/posts_controller.rb

  def index
    if params[:project].nil?
      @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
# 获取页面填写的post参数
    @post = Post.new(post_params)
    data = @post[:data]
    url = @post[:url]
    case @post[:project].to_i
      when 1, 2, 3, 4, 5 then
        key = ENV['KEY1']
      when 6, 7, 8 then
        key = ENV['KEY2']
      else
        raise "invalid key"
    end

# 对post data数据加密后发送给后台server，获取后台server的返回结果，返回给前台展示
# 判断commit参数是否为getData_ajax，利用ajax技术局部更新
    if params[:commit] == "获取数据" || params[:commit] == "Get Data"
# require 加密类
      require 'AES'
      # 此处实现AES/ECB/pkcs5padding加密，Base64编码
      # 利用httparty的post类方法发送加密的data到server
      # 此处的self.class.get调用的是include HTTParty类中的方法post
      @post[:result] = AES.get_json_by_post(url, key, data)
#@post[:result] = JSON.pretty_generate(JSON.parse(result.force_encoding("UTF-8")))
      respond_to do |format|
        format.js {}
      end
    else
# 正常commit，保存输入参数到数据库
      respond_to do |format|
        if @post.save
---
INSERT INTO "posts" ("created_at", "data", "project", "result", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2015-03-11 10:01:30.607445"], ["data", "2"], ["project", "1"], ["result", "2"], ["title", "2"], ["updated_at", "2015-03-11 10:01:30.607445"], ["url", "2"]]